Revit 2027 API
IPipePlumbingFixtureFlowServer.Calculate Method
 Calculate the pipe plumbing fixture flow.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void Calculate(
	PipePlumbingFixtureFlowData data
)
Sub Calculate (
	data As PipePlumbingFixtureFlowData
)
void Calculate(
	PipePlumbingFixtureFlowData^ data
)
abstract Calculate :
        data : PipePlumbingFixtureFlowData -> unit
Parameters
data PipePlumbingFixtureFlowData
 The input and output data of the calculation.
See Also
Reference
IPipePlumbingFixtureFlowServer Interface
Autodesk.Revit.DB.Plumbing Namespace